Autodesk.Revit.DB.MEPCalculationServerInfo.GetMEPCalculationServerInfo(Autodesk.Revit.DB.FamilyInstance)
Gets a MEPCalculationServerInfo by family instance.
famInst:
The family instance.
Returns:
The MEPCalculationServerInfo.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.MEPCalculationServerInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.MEPCalculationServerInfo.PipeUseDefinitionOnTypeGUID
The guid value ("3BF616F9-6B98-4A21-80FF-DA1120C8F6D6") of Use Definition On Type. It is not a server id, but a guid to tell if the loss method is "Use Definition On Type" or not.
If the loss method is "Use Definition On Type", we use the loss method of the family type to calculate.

Autodesk.Revit.DB.MEPCalculationServerInfo.Description
The Description of the server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.MEPCalculationServerInfo.ServerName
The Name of the server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.MEPCalculationServerInfo.ServerId
The Id of the server.

Autodesk.Revit.DB.MEPCalculationServerInfo.#ctor(Autodesk.Revit.DB.MEPCalculationServerInfo)
Constructs a new copy of the input MEPCalculationServerInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.MEPCalculationServerInfo.#ctor(Autodesk.Revit.DB.ExternalService.IExternalServer)
Create a new MEPCalculationServerInfo by an external server.
server:
The external server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.MEPCalculationServerInfo.#ctor
Constructs a new MEPCalculationServerInfo with default settings.

Autodesk.Revit.DB.MEPCalculationServerInfo
a struct to hold the information about a MEP calucation servers